# 2장. AWS를 이해하기 위한 클라우드 & 네트워크 구조

# 1. 클라우드와 온프레미스

- 클라우드 : 언제 어디서든 인터넷을 통해 접속 가능한 환경. 예를 들어, office365,유튜브 등
- 클라우드 컴퓨팅 : 서버 및 네트워크 등 인프라 전체를 임대하는 서비스
- 온프레미스 : 자사 내에서 서버를 별도로 구축하는 것
- 오프 프레미스 : 자사가 서버를 별도로 구축하지 않고 임대하고나 공공장소에 구축된 것을 사용하는 것
    - 임대하기 때문에 별도의 유지보수 인력을 확보하지 않아도 됨
- 온프레미스 → 클라우드 변경이라는 뜻은, 크게 2가지 의미가 있다.
    - 1) 비클라우드 환경에서 클라우드 환경으로 이전
    - 2) 자사에서 서버 직접 운영에서 임대로 변경
    - **즉, 같은 IT자원을 누가 관리하느냐에 따라 명칭이 바뀌는 것 뿐**

# 2. 가상화와 분산 처리 : 클라우드를 지탱하는 2대 기술

## 1. 기술1 = 가상화

- (정의) 컴퓨터의 작업을 위한 물리적인 메모리와 하드 디스크 등 물리 자원을 소프트웨어로 대체하는 것
- (why) 탄력적인 자원 조절이 가능(쓰고싶은 만큼만 쓰고,,)

## 2. 기술2 = 분산처리

- (정의) 기기 여러 대를 분산하여 처리하는 방법
- (배경)특정 이벤트나 사이트의 폭발적인 트래픽의 처리가 필요
- 이런 분배작업을 하는 징치 = 로드 밸런서

# 3. Saas,Paas,Iaas : 클라우드 서비스 제공 형태

- 셋의 구분은, “어느 수준까지 제공하는가”로 구분
- Saas : 인프라 + 애플리케이션 제공
    - 편리하지만, 자유도가 낮다
- Paas : 플랫폼까지만 제공
- Iaas : 인프라만 제공
    - 불편하고 설정할 것이 많지만, 자유도가 높다

<img width="686" alt="image" src="https://github.com/HyemIin/TIL/assets/114489245/4fc34352-340f-4e97-8563-89b36edc7336">


# 4. 서버와 인스턴스 : 네트워크상 만들어진 가상 서버

## 1) 서버란

- 어떤 서비스를 제공하는 주체 (가게의 주방같은…)
- 서버역할을 하는 컴퓨터가 특별한 컴퓨터는 아님. 다만 24시간 가동하는 것을 전제로 하기 때문에 불필요한 기능은 생략
- PC와 다른 점을 찾자면, OS를 서버용OS로 주로 사용한다는 것
    - 유닉스 계열의 리눅스 주로 사용
        - 레드햇, CentOS,Ubuntu등

## 2) 인스턴스와 서버

- AWS EC2에서 서버는 인스턴스로 생성된다
- 인스턴스 : 실제 가동되고 있는 가상화 컴퓨터(가상 서버를 의미)

