# 4장. 서버 서비스 Amazon EC2

# 1) EC2란?

- Elastic Compute Cloud
- 서버에 필요한 세트를 클라우드에서 빌릴 수 있도록 제공
- (배경) 서버 구축을 위해선 물리적 서버 기계 + 서버 OS 및 SW설치 + 네트워크 연결 및 보안 설정을 해야함
- (why) EC2는 위 작업을 담당해줌 + 사용한 사양만큼 비용 지불

## 2) EC2 운영

- 인스턴스 : AWS 클라우드에서 생성한 가상 서버
- AMI : 가상 이미지. OS만 설치된 간단한 유형부터 sw도 설정된 유형까지 다양
    - sw 인프라 구성을 작성한 템플릿
- 키 페어 : 인스턴스 접속 시 필요한 인증키
- EBS : aws 클라우드에서 사용할 수 있는 스토리지 == 인스턴스 스토리지
- Elastic IP : 고정된 IPv4 주소
    - EC2 인스턴스는 정지 후 다시 시작하면 공인 IP주소가 바뀌기 때문에 Elastic IP로 고정 IP를 잡아줘야 함
- 인스턴스 유형 : EC2 장비 사양
    - 범용,메모리 최적화,스토리지 최적화, 컴퓨팅 최적화 등으로 구분
    - 무료 버전의 t2는 범용
    - 인스턴스 크기(cpu&메모리 용량 및 성능 등) nano,micro,small,medium,large,xlarge,2xlarge,4xlarge 8종류 있음
- ELB : Elastic Load Balancing → aws가 제공하는 로드 밸런서
    - ALB : http,https 용, 애플리케이션 계층에서 동작
    - NLB : tcp 용
    - CLB : 다양한 것을 지원하지만,, 옛날꺼..classic
- 스냅샷
    - 스냅샷을 이용하여 EBS볼륨 데이터를 s3에 백업할 수 있다.
- 오토 스케일링
    - 서버 액세스 상태에 따라 서버 대수를 탄력적으로 늘리거나 줄이는 기능
    - cloudwatch에서 서버 부하 정보 데이터를 참조하여 스케일리에 참고
- 사용 순서
    - aws 로그인
    - EC2 인스턴스 생성
    - SSH로 EC2에 접속
    - SW설치 및 설정
